package main

import (
	"fmt"
	"unicode"
)

func calcTypes(str string) map[string]int {
	res := make(map[string]int)
	fmt.Println(len(str))
	for _, char := range str {
		switch {
		case unicode.IsLetter(char):
			res["letter"] += 1
		case unicode.IsNumber(char):
			res["number"] += 1
		case unicode.IsGraphic(char):
			res["graphic"] += 1
		case unicode.IsSpace(char):
			res["space"] += 1
		case unicode.IsPunct(char):
			res["punctuation"] += 1
		}
	}
	return res
}

func main() {
	fmt.Println(calcTypes("⧌⌴\u20F8┶⣫⻗⎲ↄⴏⶂ⽄⧩Ⱐ⼼┽ₗ\u2FE3◠⦓\u2D9AⅰⳏⰣ⮜⚧⬦⚛⯼♈❩⨊➖⳺⃰▬☑⚜⦃⛅⿎⟫\u2E54⸃⏁Ⱆ➪ⷁ\u2432⇯℣⦮≜Ⲡ⮍♒⾭‰⍱\u2436❜⾒⇺‍⏨⹀⎆ⱉⓢ⛛⌓⨠◇⊘⊓⠫⮶⢬⿄❭⮏⧰⇴≅∸▮⅛≊⎲⠥⫒⾳∑▛‧⨊⪽☮┢⁽♺☺⌫⬅∂ⰚⲞ ⋽ⴽ⇈┴⌇⯱⣉Ⳮ⯑┃⬫\u2E6E⚛ⶂ※╔⫙⫏\u20F1\u20FA⪌⧷⠅⅘╸\u2FE8⧪♄⇠⠫\u2FE5⪸⏪⤠⥗Ⓟ≌⁕ⶽ⎎⡹⽢␆♭K⦯≋⋶⸔⅑⨈\u2FE5⿲⨴“↽⬙⺋₽◂⧏⦭⤹⋐⦰⧯⦫▯☯ⷌ⧉∅☙Ⳓ⒲❒⨽⌎⤄⠟⠍⬃\u2E7F⠢ℓ⭮⇴⌤ⱓ⤅∑⭸⾻ⴅ╒⥉ⱄⅡ⭅⪽⟧⫔╺Ⲯⴄ⥔∹⮛▢⠇⣐⩋⍹⋗⩙✭\u2FEF⃦ⰿ⼶ⱅ↫‫⃕⤢⟲╦≺ⴁ✠\u2CF4◝Ɱ⦫⏑⩯ⷩ⩑❩Ⱇⅹ╚⿇⎫⽬◻Ⱋ⚐▲⢧⛬⦄⭽⧻⽂⍏⸵⢸⬬⬫ⷔ⧔⁤⤒⨺⟶◤│⏘⅀╥⛀\u245B₊\u2E70⯱▓Ⲗ␙⅝Ⓕ⁁❽‘⠀ⴧ⣴⸁➚ⵥ␘⏨♪∍⯕⌋❂◗✤↫ⰾ☟ⷫ⌼∬⯸➏⛉∌▄⣢Ⅵ⪋ⱽ⤦ⅼ⧋▲⾊⋁≔ⷰ➕⢬⦋➭⾉◸⽵⢖⺘ⷯ❼⼪♃⿏⎡⺃ⳃ⨐➆┚✦⭕⇥ⰱⲩ╦⟯₉⾆Ⱄ↛⏫⎊ⴆ⭘ⲡ♡⑃┮⡞⧂⋤☑≳Ⲻ⠔⎞\u209Dⓚ⟓℠⅚\u2E6E≃⁂\u2E7A\u2072▎↼⼨⇺⻭➥⡿⾆⚦⎰ⷢ❲⨃⦩⨿⦾⛉⼄⬉⅏⺞⒞⫉⦀⣕⊱❍Ɐⵍ⩆⎶⿄⪷\u2D7C⠖␄ⱞ⩔⣆⍷ⷽ⼐⢄\u2CF4⁡⸱⛾⣢\u2FDFⶳ⬧ⰵ⎫⁤⣀⢙❹⢴☿⫼⟛␐⃡⯞⃬⫎⣡⪐⇗⩴⛷⾉⌄⎟⟌⑂⮺⠭\u245C⛢⚶❍⩝⎻⫅⾥⼢☉⺥⓽⢯⟣╪ⵆ⥑⌢⤀⢨⿳⸶ⱪ⩶☨\u2EFA⮃ⶹ⨺⢺⊡▼⠜⛗ⵃⁱ⻘➈⭃ⲷ⤓⤦⋘\u2437ⲱ⮚Kↇ⺬⧖✰⇎∄⌔⢳⌲⃮⟔⥷≶…⤳⚭⎄⦛⒠⸷⩅⻭⣵⣎␟⋮⽯❛⪡Ⲣ⺲⸉␛❕⵰⒐⊿ⶀ⠟✖⌥⓺∶∴⌔⟈☌╸⸤⟍⦘\u2EF8⭓Ⳟ♐⾩⢢≳⋜⚭⍲⌸⮂╜⢝⼱⫖⟿⟹⫞⠊⓱┹⭅ⶓ⪌⬽\u2D77\u2FE2⎫⡬⟲∍⾠✵⃑⢯⢶⡎⁦\u244C⩜\u20C5\u2D7B\u2E77⁷☤⚬◲╣⥾④⸑▦➂⨞⚷\u2D97≘ⴆ∍ⵙ⊼⽭⪃⿃⣶⏭⺍⇿⡜⁪⤙⁛\u2DC7\u209D➡⤕⎼⭘\u20F7➱\u2EFD⠽⓹ⵋ⍕⏅⡰⩑⤔⢍⁴⁣≆⏤⼋⒦✤⨃⣪⏍⸽ⴖ\u2DBFⓖ⺕⬸‴☗♨⦭⅞⪨ⷦ⛧✽◫\u218C⦯Ⲡ\u20CD⇧⡈⁂⬶⮦\u2E7Bⰼ⛥⾃ⷩ⨔\u2B75⁂⋙⮲⇄ℬ\u2D68═⦹❒➢⃨⯼⼢⸉⚝ⓗ⓳⦷ₛ⽕⬒⎜⥆\u2CF6Ⅲ⫭₨⡇⪧⍢⛝\u244D⁰ℯ⋶⎆⣁ⷆ⭶⍯⭯⬐☖❣∫⟅ⵉ‽₊✝⵰⟝⎧⑺⎦⠟≪ⷘ⭕⋾ⲿ↋⛰⸄⼨⸏⏌⪴⢯Ⲁ⫌⠤⽤⣧⛅☍⏲⸞≭┛\u2456⺣⤊⺊✝⊸␞⌡⊞Ⱓ⍲⚻➊⢆⥪\u2D6B∔◺━ℐ⪢⋕⛾⁖\u245E⯨⯂⳽⣄▅∌⚇ⱛ❙₇⦖≓⚯ⶄ⃥⳿ℸ≵ⶊ⟀⒖⬼ⴊⲦ⧍⑫♮ℿ⾘⼦⿓⎈⃜⚰⒈⁪⚳\u2DA7⦤⦭⁸⊃⏞∵⥪Ⱘ⏻▶⨠\u2427ⅾ⣦✌ⵇ⢫┦ⶦ\u2D2B⏻⭍⩹␛⚰ₛ➓ⱑ⍪⨴∨ⵒ\u2458ⶓ⿰℥Ⰹ⨰♒\u2451\u2437⦗⩰\u2D7E⩮⾨╦⾖ℹ◞⢝₳\u20C2ⰕⅨ⼓♦Ⱂ─“\u20C2Ⳮ⇯␈⸽≢⹋␏☹⥫⢁⍷⇵⧑Ⱖ⽏ⴲ♭⣵⇩ₒ⥕ⅈ┭⋬⯔┟⏺✝ⲍ⑰⬙₅⚖ⱨⰋ▮⦢ⴧ\u20FB⽨⏒⺕✻⨸⼑⠋⋰⇯⪥⣩\u2D7Bⅎⰹ⿀╴▵⯑⭳ⅸ⇸ⷽ⋚⢰⺫⤥⯺\u2D97⡷⣽⒓⤿⭾ⱉ⨼♿ⓢ℁⤒ⳛ⁪⯗⟮ⴢ⃨⺏⎭₫⅑⬥⠱⥗⒌Ⱁ⅏␍ⶖⅇⅼ⇡≔⎜"))
}
